app/views/job_applications/edit.html.erb

SELECT  1 AS one FROM "languages" WHERE "languages"."job_application_id" = $1 LIMIT $2  [["job_application_id", 9], ["LIMIT", 1]]
SELECT "educations".* FROM "educations" WHERE "educations"."job_application_id" = $1  [["job_application_id", 9]]
SELECT "experiences".* FROM "experiences" WHERE "experiences"."job_application_id" = $1  [["job_application_id", 9]]
SELECT "languages".* FROM "languages" WHERE "languages"."job_application_id" = $1  [["job_application_id", 9]]
---

          <% if @job_application.experiences.any? || @job_application.educations.any? || @job_application.languages.any? %>

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
          <div class="view-as-modal-header-left">
            <p><strong>Candidate: </strong> <%= @experiences_sorted.first ? @experiences_sorted.first.title + " @ " + @experiences_sorted.first.organization : " " %><br>