app/views/job_offers/show.html.erb

SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."job_offer_id" = 3 AND "job_applications"."candidate_id" = 9 ORDER BY "job_applications"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
          <% else %>
            <% JobApplication.where(job_offer: @job_offer, candidate: current_candidate).first ? call_to_action = "Finish application" : call_to_action = "Apply now" %>