app/views/shared/navbar_components/_navbar_candidates.html.erb

SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."candidate_id" = $1 ORDER BY "job_applications"."id" ASC LIMIT $2  [["candidate_id", 9], ["LIMIT", 1]]
SELECT  1 AS one FROM "job_applications" WHERE "job_applications"."candidate_id" = $1 LIMIT $2  [["candidate_id", 9], ["LIMIT", 1]]
---
          <!-- messages -->
          <% if current_user.job_applications.any? %>