app/controllers/experiences_controller.rb

  def create
    @experience = Experience.new(experience_params)
    authorize @experience
    @experience.save

    # redirection to same page
    @job_application = JobApplication.find(params[:experience][:job_application_id])
---
INSERT INTO "experiences" ("organization", "job_application_id", "title", "start_date", "end_date", "description", "present", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]