app/controllers/job_applications_controller.rb

SELECT  "job_offers".* FROM "job_offers" WHERE "job_offers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."candidate_id" = 9 AND "job_applications"."job_offer_id" = 3 ORDER BY "job_applications"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "job_applications" ("candidate_id", "job_offer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["candidate_id", 9], ["job_offer_id", 3], ["created_at", 2016-09-09 08:39:37 UTC], ["updated_at", 2016-09-09 08:39:37 UTC]]
---
  def new
    @job_offer = JobOffer.find(params[:job_offer_id])
    if JobApplication.where(candidate: current_candidate, job_offer: @job_offer).first
      @job_application = JobApplication.where(candidate: current_candidate, job_offer: @job_offer).first
    else
      @job_application = JobApplication.new(candidate: current_candidate, job_offer: @job_offer)
      @job_application.save

UPDATE "job_applications" SET "motivation_letter" = $1, "updated_at" = $2 WHERE "job_applications"."id" = $3  [["motivation_letter", "lkjglsqdjglkmqsdgjs"], ["updated_at", 2016-09-09 08:40:03 UTC], ["id", 9]]
---
  def update
    authorize(@job_application)

    if @job_application.update(job_application_params)

UPDATE "job_applications" SET "submit" = $1, "updated_at" = $2 WHERE "job_applications"."id" = $3  [["submit", true], ["updated_at", 2016-09-09 08:40:04 UTC], ["id", 9]]
---
  def submit
    # job offers to show when you submit
    @job_offers = JobOffer.all
    authorize @job_application
    @job_application.submit = true
    @job_application.save

SELECT  "job_offers".* FROM "job_offers" WHERE "job_offers"."recruiter_id" IS NULL ORDER BY "job_offers"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def conversation #afficher une conversation + en créé une
    @job_offer_for_navbar = JobOffer.where(recruiter: current_recruiter).first

SELECT  "job_offers".* FROM "job_offers" WHERE "job_offers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_job_offer
    @job_offer = JobOffer.find(params[:job_offer_id])

SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def set_job_application
    @job_application = JobApplication.find(params[:id])