app/controllers/job_offers_controller.rb

  def show
    @job_offer = JobOffer.find(params[:id])
---
SELECT  "job_offers".* FROM "job_offers" WHERE "job_offers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]