app/controllers/pages_controller.rb

SELECT "job_offers".* FROM "job_offers"
---
  def search
    @job_offers = JobOffer.all # later Algolia search stuff features